/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "État"; /* Display Name */

"mQr54o" = "inconnu";   /* Value: unknown */
"8K78Gu" = "Non terminé";      /* Value: open */
"HSjTOt" = "Terminé"; /* Value: completed */
"1Ncljt" = "Annulé";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Tâche Things"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "Titre";     /* Property: title */
"Kw5NWX" = "Liste";      /* Property: list */
"R3fuSz" = "Quand";      /* Property: when */
"8TjwzE" = "Soir";   /* Property: evening */
"gRh7no" = "Non";        /* Property: evening (false value) */
"WHB5qC" = "Oui";       /* Property: evening (true value) */
"bww4JS" = "Rappel";  /* Property: reminder */
"19lPBk" = "Échéance";  /* Property: deadline */
"pp3qBd" = "Notes";     /* Property: notes */
"UDIc1x" = "Liste de pointage"; /* Property: checklist */
"KQzIKq" = "Mots-clés";      /* Property: tags */

/* TINList */

"x7Empa" = "Liste Things"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "Ajouter une tâche"; /* Title */
"1Xn7Aa" = "Permet d'ajouter une tâche dans Things."; /* Description */

"YmSQDf" = "Tâche"; /* Parameter: title */
"LHHz9E" = "Quel est le titre ?"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "Liste"; /* Parameter: list */
"X4r1DR" = "À quelle liste souhaitez-vous l'ajouter ?"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "Quand"; /* Parameter: when */
"VkNe0C" = "Quand voulez-vous commencer ?"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "Soir"; /* Parameter: evening */
"b10WOZ" = "En soirée ?"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "Non"; /* Parameter: evening (false value) */
"KWUIrj" = "Oui"; /* Parameter: evening (true value) */

"AeXgbS" = "Heure du rappel"; /* Parameter: reminderTime */
"3Nk1Yl" = "À quelle heure voulez-vous recevoir un rappel ?"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "Échéance"; /* Parameter: deadline */
"xi8sPe" = "Quelle est l'échéance ?"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "Mots-clés"; /* Parameter: tags */
"l0xizU" = "Quels mots-clés faut-il ajouter ?"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "État"; /* Parameter: status */
"sS5Ms4" = "Quel est l'état ?"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "Modifier dans Things"; /* Parameter: editInThings */
"W5N6Yo" = "Voulez-vous ouvrir Things pour modifier cette tâche ?"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "Non"; /* Parameter: editInThings (false value) */
"ZSGv41" = "Oui"; /* Parameter: editInThings (true value) */

"o8AABR" = "Notes"; /* Parameter: notes */
"pjyLst" = "Quelles notes souhaitez-vous ajouter ?"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "Liste de pointage"; /* Parameter: checklist */
"VIitBC" = "Quels éléments de liste de pointage souhaitez-vous ajouter ?"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "${todoTitle} a été ajouté."; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "${todoTitle} a été ajouté."; /* Response Code: success (printed dialog) */
"sr1IRz" = "Une erreur s'est produite lors de l'ajout de la tâche."; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "Une erreur s'est produite lors de l'ajout de la tâche."; /* Response Code: failure (printed dialog) */
"j6LE7B" = "La tâche a été ajoutée."; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "La tâche a été ajoutée."; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "Titre de la tâche"; /* Response Parameter: todoTitle */
"Br1Zm3" = "Tâche"; /* Response Parameter: todo */

"9LylOv" = "Ajouter ${title}"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "Ajouter ${title}"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "Afficher la tâche"; /* Title */
"JdIZ8x" = "Permet d'afficher la tâche spécifiée dans Things."; /* Description */

"WAIq5F" = "Tâche"; /* Parameter: todo */

"YIbDyi" = "Afficher ${todo}"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "Afficher la liste"; /* Title */
"xo5PDm" = "Permet d'afficher la liste spécifiée dans Things."; /* Description */

"RW2Nyz" = "Liste"; /* Parameter: list */
"V1nlDA" = "Quelle liste ?"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "Filtrer par mots-clés"; /* Parameter: filterByTags */
"HQ0TAS" = "Quelles mots-clés ?"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "Afficher ${list}"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "Afficher ${list}"; /* Shortcuts App: list (title) */

"mlANgr" = "Afficher ${list}"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "Exécuter une URL Things"; /*  Title */
"keYeZ9" = "Permet d'exécuter une URL Things en arrière-plan."; /*  Description */

"uPeA3l" = "URL Things"; /*  Parameter: url */
"oTrE0f" = "Quelle est l'URL ?"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "L'URL a bien été exécutée."; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "L'URL a bien été exécutée."; /*  Response Code: success (printed dialog) */
"a4aEdR" = "Une erreur s’est produite lors de l'exécution de l'URL."; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "Une erreur s’est produite lors de l'exécution de l'URL."; /*  Response Code: failure (printed dialog) */

"uth0Px" = "Exécuter une URL Things ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "Ajouter des tâches"; /* Title */
"J4CdGj" = "Permet d'utiliser la fonctionnalité intégrée pour ajouter des tâches dans Things. Seuls quelques paramètres sont disponibles."; /* Intent AddTasks -> Description */

"IF3OZi" = "Liste de tâches"; /* Parameter: targetTaskList */
"uNB8yE" = "Titres"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "Ouvrir Things"; /* Suggestions:  (title) */
